# Import librs

In [87]:
# !pip install pandas

In [88]:
import pandas as pd 
import numpy as np

# Create DataFrame

In [89]:
data = [["A" , 23 , 100], ["B" , 24 , 80] , ["C" , 22 , 85]]
df = pd.DataFrame(data , columns=["name" , "age" , "grade"] , 
                 index = ["a" , "b" , "c"])
df

  name  age  grade
a    A   23    100
b    B   24     80
c    C   22     85

In [90]:
df.columns

Index(['name', 'age', 'grade'], dtype='object')

In [91]:
df.index

Index(['a', 'b', 'c'], dtype='object')

In [92]:
np.random.seed(123)
matrix = np.random.randint(10 , 100 , (100 , 5))

In [93]:
df = pd.DataFrame(matrix)

# EDA

In [94]:
df.head()

    0   1   2   3   4
0  76  27  93  67  96
1  57  83  42  56  35
2  93  88  46  90  78
3  59  65  77  12  94
4  49  76  94  57  71

In [95]:
df.tail()

     0   1   2   3   4
95  43  44  73  22  36
96  81  50  51  38  25
97  62  55  78  46  69
98  83  24  30  43  95
99  95  18  35  86  27

In [96]:
df = df.rename(columns={0:"col1" , 1:"col2" , 2: "col3" , 3: "col4" , 4:"col5" })

In [97]:
df.head()

   col1  col2  col3  col4  col5
0    76    27    93    67    96
1    57    83    42    56    35
2    93    88    46    90    78
3    59    65    77    12    94
4    49    76    94    57    71

In [98]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    100 non-null    int32
 1   col2    100 non-null    int32
 2   col3    100 non-null    int32
 3   col4    100 non-null    int32
 4   col5    100 non-null    int32
dtypes: int32(5)
memory usage: 2.1 KB

In [99]:
df.isna().sum()

col1    0
col2    0
col3    0
col4    0
col5    0
dtype: int64

In [100]:
True + True

2

In [101]:
df.isnull().sum()

col1    0
col2    0
col3    0
col4    0
col5    0
dtype: int64

In [102]:
df.duplicated()

0     False
1     False
2     False
3     False
4     False
      ...
95    False
96    False
97    False
98    False
99    False
Length: 100, dtype: bool

In [103]:
df[df.isna().any(axis = 1)]

Empty DataFrame
Columns: [col1, col2, col3, col4, col5]
Index: []

In [104]:
df[df.duplicated()]

Empty DataFrame
Columns: [col1, col2, col3, col4, col5]
Index: []

In [105]:
type(df["col5"])

pandas.core.series.Series

In [106]:
df["col5"] = (df["col5"] + 3)

In [107]:
# df.col5
def check(num):
    if num % 2 == 0 :
        return "Even"
    else:
        return "Odd"

In [109]:
df["col6"] = df["col5"].apply(check)

In [110]:
df

    col1  col2  col3  col4  col5  col6
0     76    27    93    67    99   Odd
1     57    83    42    56    38  Even
2     93    88    46    90    81   Odd
3     59    65    77    12    97   Odd
4     49    76    94    57    74  Even
..   ...   ...   ...   ...   ...   ...
95    43    44    73    22    39   Odd
96    81    50    51    38    28  Even
97    62    55    78    46    72  Even
98    83    24    30    43    98  Even
99    95    18    35    86    30  Even

[100 rows x 6 columns]

In [111]:
df["col6"].value_counts()

Even    52
Odd     48
Name: col6, dtype: int64

In [112]:
df["col6"].nunique()

2

In [115]:
df["col6"].unique()

array(['Odd', 'Even'], dtype=object)

In [116]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    100 non-null    int32
 1   col2    100 non-null    int32
 2   col3    100 non-null    int32
 3   col4    100 non-null    int32
 4   col5    100 non-null    int32
 5   col6    100 non-null    object
dtypes: int32(5), object(1)
memory usage: 2.9+ KB

In [122]:
df.describe()

             col1       col2        col3        col4        col5
count  100.000000  100.00000  100.000000  100.000000  100.000000
mean    51.350000   56.48000   51.340000   57.820000   59.580000
std     25.783236   27.91165   24.640945   26.715629   28.045122
min     10.000000   10.00000   10.000000   11.000000   13.000000
25%     29.000000   29.00000   31.750000   36.000000   36.250000
50%     49.000000   56.00000   50.500000   60.500000   60.000000
75%     74.250000   82.25000   71.500000   80.000000   86.250000
max     98.000000   99.00000   98.000000   99.000000  102.000000

In [119]:
df.describe(include="object")

        col6
count    100
unique     2
top     Even
freq      52

In [121]:
# df.describe(include="all")

In [123]:
df

    col1  col2  col3  col4  col5  col6
0     76    27    93    67    99   Odd
1     57    83    42    56    38  Even
2     93    88    46    90    81   Odd
3     59    65    77    12    97   Odd
4     49    76    94    57    74  Even
..   ...   ...   ...   ...   ...   ...
95    43    44    73    22    39   Odd
96    81    50    51    38    28  Even
97    62    55    78    46    72  Even
98    83    24    30    43    98  Even
99    95    18    35    86    30  Even

[100 rows x 6 columns]

In [124]:
x = "amit"
x.replace("a" , "A")

'Amit'

In [127]:
df["col7"] = df["col6"].replace({"Even":0 , "Odd":1} )

In [128]:
df

    col1  col2  col3  col4  col5  col6  col7
0     76    27    93    67    99   Odd     1
1     57    83    42    56    38  Even     0
2     93    88    46    90    81   Odd     1
3     59    65    77    12    97   Odd     1
4     49    76    94    57    74  Even     0
..   ...   ...   ...   ...   ...   ...   ...
95    43    44    73    22    39   Odd     1
96    81    50    51    38    28  Even     0
97    62    55    78    46    72  Even     0
98    83    24    30    43    98  Even     0
99    95    18    35    86    30  Even     0

[100 rows x 7 columns]

In [130]:
df.to_csv("data.csv" , index=False)

In [ ]:
# df.to_excel("data.xlsx")

In [131]:
# import librs
# load dataset 
# EDA
# data preprocessing
# train model 
# predict model ("red" , 2010 , 4 , 160 , 1600 , "BMW")>>> 200000

In [133]:
df2 = pd.read_csv("data.csv")

In [135]:
df.head()

   col1  col2  col3  col4  col5  col6  col7
0    76    27    93    67    99   Odd     1
1    57    83    42    56    38  Even     0
2    93    88    46    90    81   Odd     1
3    59    65    77    12    97   Odd     1
4    49    76    94    57    74  Even     0

In [137]:
type(df["col5"])

pandas.core.series.Series

In [139]:
type(df[["col5"]])

pandas.core.frame.DataFrame

In [143]:
df[["col1" , "col2"]].head(3)

   col1  col2
0    76    27
1    57    83
2    93    88

In [150]:
# df.iloc[rows , cols_index]
df.iloc[0:4 , 0:-1]

   col1  col2  col3  col4  col5  col6
0    76    27    93    67    99   Odd
1    57    83    42    56    38  Even
2    93    88    46    90    81   Odd
3    59    65    77    12    97   Odd

In [149]:
# df.loc[rows , col_name]
df.loc[0:4 ,["col1" , "col2", "col3"] ]

   col1  col2  col3
0    76    27    93
1    57    83    42
2    93    88    46
3    59    65    77
4    49    76    94

In [152]:
df3 = pd.DataFrame({"name" : ["A" , "B" , "C" , "C" , "D"],
             "age": [ 23 , np.nan , 22 , 22 , 25 ],
             "grade": [100 , 90 , 80 , 80 , 70]})

In [153]:
df3

  name   age  grade
0    A  23.0    100
1    B   NaN     90
2    C  22.0     80
3    C  22.0     80
4    D  25.0     70

In [155]:
df3.isna().sum()

name     0
age      1
grade    0
dtype: int64

In [158]:
df3[df3.isna().any(axis=1)]

  name  age  grade
1    B  NaN     90

In [160]:
df3.duplicated().sum()

1

In [161]:
df3[df3.duplicated()]

  name   age  grade
3    C  22.0     80

In [168]:
# df3.drop_duplicates(inplace=True)
df3 = df3.drop_duplicates()

In [169]:
df3

  name   age  grade
0    A  23.0    100
1    B   NaN     90
2    C  22.0     80
4    D  25.0     70

In [170]:
df3.dropna()

  name   age  grade
0    A  23.0    100
2    C  22.0     80
4    D  25.0     70

In [172]:
df3["age"].fillna(df3["age"].mean())

0    23.000000
1    23.333333
2    22.000000
4    25.000000
Name: age, dtype: float64

In [173]:
df3["age"]

0    23.0
1     NaN
2    22.0
4    25.0
Name: age, dtype: float64

In [174]:
df3["age"].fillna(method = "ffill")

0    23.0
1    23.0
2    22.0
4    25.0
Name: age, dtype: float64

In [175]:
df3["age"].fillna(method = "bfill")

0    23.0
1    22.0
2    22.0
4    25.0
Name: age, dtype: float64

In [176]:
df

    col1  col2  col3  col4  col5  col6  col7
0     76    27    93    67    99   Odd     1
1     57    83    42    56    38  Even     0
2     93    88    46    90    81   Odd     1
3     59    65    77    12    97   Odd     1
4     49    76    94    57    74  Even     0
..   ...   ...   ...   ...   ...   ...   ...
95    43    44    73    22    39   Odd     1
96    81    50    51    38    28  Even     0
97    62    55    78    46    72  Even     0
98    83    24    30    43    98  Even     0
99    95    18    35    86    30  Even     0

[100 rows x 7 columns]

In [177]:
df.groupby("col6")["col5"].max()

col6
Even    102
Odd     101
Name: col5, dtype: int32

In [178]:
df.groupby("col6")["col5"].min()

col6
Even    16
Odd     13
Name: col5, dtype: int32

In [179]:
df.groupby("col6")["col5"].sum()

col6
Even    3138
Odd     2820
Name: col5, dtype: int32

In [180]:
df.groupby("col6")["col5"].mean()

col6
Even    60.346154
Odd     58.750000
Name: col5, dtype: float64

In [181]:
df.groupby("col6")["col5"].count()

col6
Even    52
Odd     48
Name: col5, dtype: int64

In [184]:
group = df.groupby("col6")["col5"].agg(["min" , "max" , "mean" , "sum" , "count"])
group

      min  max       mean   sum  count
col6
Even   16  102  60.346154  3138     52
Odd    13  101  58.750000  2820     48

In [186]:
g1 = group.reset_index()
g1

   col6  min  max       mean   sum  count
0  Even   16  102  60.346154  3138     52
1   Odd   13  101  58.750000  2820     48

In [188]:
g2 = g1.set_index("col6")
g2

      min  max       mean   sum  count
col6
Even   16  102  60.346154  3138     52
Odd    13  101  58.750000  2820     48